In [2]:
import warnings

In [3]:
warnings.filterwarnings('ignore')

In [5]:
import pandas as pd
import numpy as np

In [8]:
#1
file_path=r'C:\Users\barad\OneDrive - Indian School of Business\Bhavatarini\downloads\sample_customers_50.xlsx'
df=pd.read_excel(file_path)

In [9]:
df.shape

(50, 6)

In [10]:
df.head(2)

,Name,Email,Address,Sales Volume,Most Purchased Product,Geography
0,Skyler Smith,skyler.smith@example.com,"278 Oak Street, Washington",34575,Granola Bars,Georgia
1,Taylor Johnson,taylor.johnson@example.com,"551 Pine Street, Arizona",48826,Protein Cookies,Arizona

In [19]:
customer = \
    {
        "Name": "Peyton Brooks",
        "Email": "peyton.brooks@example.com",
        "Address": "777 Willow Drive, Nevada",
        "Sales Volume": 82000,
        "Most Purchased Product": "Energy Bars",
        "Geography": "Nevada"
    }

In [61]:
def func(customer,df):
    if customer['Email'] in df.Email.unique():
        n=df[df.Email==customer['Email']].index[0]
        df.loc[n]=list(customer.values())     
    else:
        df.loc[len(df)]=list(customer.values())
    return df

In [63]:
d_f=func(customer,df)

In [ ]:
#2

In [73]:
df.groupby('Geography')['Name'].count().sort_values(ascending=False)[:10]

Geography
California    8
Florida       7
Nevada        7
Illinois      6
Texas         6
Arizona       5
Washington    5
Ohio          3
Georgia       2
New York      2
Name: Name, dtype: int64

In [111]:
california_df = df[df['Geography'] == 'California']
florida_df = df[df['Geography'] == 'Florida']
filtered_df = pd.concat([california_df, florida_df])
filtered_df[['Name','Geography']][:10]

             Name   Geography
7   Skyler Taylor  California
18    Dana Wilson  California
19    Dana Wilson  California
26     Dana Davis  California
27  Skyler Wilson  California
29   Robin Taylor  California
37   Casey Wilson  California
46    Dana Miller  California
8     Casey Smith     Florida
20  Jordan Miller     Florida

In [88]:
df.sort_values('Sales Volume',ascending=False)[['Name','Sales Volume']][:10]

             Name  Sales Volume
29   Robin Taylor         98602
41   Robin Miller         98062
4       Robin Lee         96674
40   Chris Wilson         91206
0   Peyton Brooks         88989
9   Jordan Miller         87853
19    Dana Wilson         87328
43   Jamie Taylor         86434
32   Skyler Brown         85581
33   Skyler Moore         84411

In [94]:
df.groupby(['Most Purchased Product'])['Name'].count().sort_values(ascending=False)

Most Purchased Product
Energy Bars        11
Granola Bars        9
Smoothie Packs      8
Protein Cookies     6
Fruit Snacks        5
Nut Butters         5
Organic Chips       4
Trail Mix           3
Name: Name, dtype: int64

In [112]:
df[df['Most Purchased Product']=='Energy Bars'][['Name','Most Purchased Product']][:10]

              Name Most Purchased Product
0    Peyton Brooks            Energy Bars
7    Skyler Taylor            Energy Bars
8      Casey Smith            Energy Bars
17     Alex Miller            Energy Bars
19     Dana Wilson            Energy Bars
22  Casey Anderson            Energy Bars
31     Jamie Brown            Energy Bars
38    Dana Johnson            Energy Bars
42     Alex Taylor            Energy Bars
48   Alex Anderson            Energy Bars